DataProcessors/ЛБ_ПомощникЗаполненияПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ПомощникЗаполненияПроцентныхСтавок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДниНачалаПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНачалаПрименения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДиапазоныСумм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ЛБ_ПричиныПримененияПроцентнойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ПричиныПримененияПроцентнойСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЛБ_ПомощникЗаполненияПроцентныхСтавок/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СхемаКредитования") Тогда 
		Объект.СхемаКредитования = Параметры.СхемаКредитования;  
		Для каждого СтрП Из Объект.СхемаКредитования.ПричиныПримененияПроцентнойСхемы Цикл 
			НоваСтрП = ПричиныПрименения.Добавить();
			НоваСтрП.ПричинаПрименения = СтрП.ПричинаПрименения; 
			Элементы.ДниНачалаПримененияПричинаПрименения.СписокВыбора.Добавить(СтрП.ПричинаПрименения);
		КонецЦикла;		
		
		Если Параметры.Свойство("Акция") Тогда  
			Объект.Акция = Истина; 
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " (акция)";
		КонецЕсли;	
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// заполним таблицы	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛОЖЬ КАК Пометка,
	               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус,
	               |	ВЫБОР
	               |		КОГДА ЛБ_СтатусыЗалогодателей.ЭтоГруппа
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоГруппа,
	               |	ЛБ_СтатусыЗалогодателей.Родитель КАК Родитель,
	               |	ЛБ_СтатусыЗалогодателей.Наименование КАК СтатусСтрока,
	               |	ЛОЖЬ КАК ТолькоПросмотр
	               |ИЗ
	               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Статус ИЕРАРХИЯ"; 
	ДанныеДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией); 	    
		
	СтрокаВерхнего = ДанныеДерево.Строки.Добавить();	
    СтрокаВерхнего.СтатусСтрока = "Все статусы";
	СтрокаВерхнего.ЭтоГруппа = ложь; 
	
	ЗначениеВРеквизитФормы(ДанныеДерево, "ДеревоСтатусов"); 
	
	Если Параметры.Свойство("АдресХранилища") Тогда 
		ТаблицаСтавок = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);		
		Если Объект.Акция Тогда           
			Удстроки = новый СписокЗначений;
			Для каждого стр Из ТаблицаСтавок цикл   
				Если стр.СхемаКредитования = Объект.СхемаКредитования тогда
					Продолжить;
				КонецЕсли;
				Удстроки.Добавить(Стр);
			КонецЦикла;	               
			Для каждого Эл Из УдСтроки Цикл
				ТаблицаСтавок.Удалить(Эл.Значение);
			Конеццикла;	
		КонецЕсли;
		ЗаполнитьПоДокументу(ТаблицаСтавок); 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументу(ТаблицаСтавок)  
	ТабСтатусов = ТаблицаСтавок.Скопировать();  
	ТабСтатусов.Свернуть("СтатусЗалогодателя"); 
	ТабДни = ТаблицаСтавок.Скопировать();  
	Если Объект.Акция Тогда
	    ТабДни.Свернуть("СтатусЗалогодателя, ПричинаПрименения");
	Иначе   
		ТабДни.Свернуть("СтатусЗалогодателя, ПричинаПрименения, ДеньНачалаПрименения");
	КонецЕсли;	
	ТабДиапазоны = ТаблицаСтавок.Скопировать(); 
	ТабДиапазоны.Свернуть("СтатусЗалогодателя, ДиапазонСумм"); 
	ДеревоНаСервере = РеквизитФормыВЗначение("ДеревоСтатусов"); 
	Для каждого СтрС Из ТабСтатусов Цикл 
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Статус", СтрС.СтатусЗалогодателя);
		
		НайдСтроки = ДеревоНаСервере.Строки.НайтиСтроки(ПараметрыПоиска, Истина);
		Если НайдСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаД = НайдСтроки.Получить(0);
		СтрокаД.Пометка = Истина;  
		Если СтрокаД.ЭтоГруппа Тогда
		    ПроставитьГалочкиПоГруппе(ДеревоНаСервере, СтрС.СтатусЗалогодателя, Истина);   
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("СтатусЗалогодателя", СтрС.СтатусЗалогодателя);
		
		Строки = ТабДни.НайтиСтроки(Отбор);     
		Для каждого Стр Из Строки Цикл   
			НоваяСтр = Объект.ДниНачалаПрименения.Добавить(); 
			НоваяСтр.статус = СтрС.СтатусЗалогодателя;
			НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения; 
			Если НЕ Объект.Акция Тогда
			    НоваяСтр.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
			КонецЕсли;	
		КонецЦикла;
		
		Строки = ТабДиапазоны.НайтиСтроки(Отбор);     
		Для каждого Стр Из Строки Цикл   
			НоваяСтр = Объект.ДиапазоныСумм.Добавить(); 
			НоваяСтр.статус = СтрС.СтатусЗалогодателя;
			НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;
		КонецЦикла;	
	Конеццикла;	    
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "ДеревоСтатусов");
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораГруппы(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", Результат);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДиапазоныСуммЗайма.Ссылка КАК ДиапазонСумм
	               |ИЗ
	               |	Справочник.ЛБ_ДиапазоныСуммЗайма КАК ЛБ_ДиапазоныСуммЗайма
	               |ГДЕ
	               |	ЛБ_ДиапазоныСуммЗайма.Родитель = &Родитель
	               |	И ЛБ_ДиапазоныСуммЗайма.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДиапазоныСуммЗайма.ПорядокСортировки";
	ТаблицЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТаблицЗапроса Цикл   
		НоваяСтр = Объект.ДиапазоныСумм.Добавить();
		НоваяСтр.статус = Текущийстатус;
		НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм; 
	Конеццикла;	  
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьДиапазонПоГруппе(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораГруппы",ЭтаФорма);   
	ОткрытьФорму("Справочник.ЛБ_ДиапазоныСуммЗайма.ФормаВыбораГруппы",, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьЗаполнения()
	ВсеОК = Истина;
		
	Если Объект.СтатусыКлиентов.Количество() = 0 Тогда
		Сообщить("Не выбраны статусы клиента!");
		ВсеОК = Ложь;
	КонецЕсли;   
	
	Для каждого стр Из Объект.СтатусыКлиентов цикл
		СтатусК = ?(НЕ ЗначениеЗаполнено(Стр.статус), "Все статусы", Стр.Статус);
        Отбор = новый Структура;
		Отбор.Вставить("Статус", Стр.Статус);    
		
		Строки = Объект.ДниНачалаПрименения.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Сообщить("Не выбраны причины применения % ставки для статуса клиента " + СокрЛП(СтатусК) + "!");
			ВсеОК = Ложь;
		КонецЕсли;	
		Если ВсеОК И НЕ Объект.Акция Тогда
			Для сч = 0 По Строки.Количество()-1 Цикл  
		        Если Строки.Получить(сч).ДеньНачалаПрименения = 0 Тогда 
			        Сообщить("Установлен нулевой день начала применения % ставки для статуса клиента " + СокрЛП(СтатусК) + "!");
			        ВсеОК = Ложь;  
					Прервать;
			    КонецЕсли;
			КонецЦикла;
		КонецЕсли;	

		Строки = Объект.ДиапазоныСумм.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Сообщить("Не выбраны диапазоны сумм для статуса клиента " + СокрЛП(СтатусК) + "!");
			ВсеОК = Ложь;
		КонецЕсли;   
		Если ВсеОК Тогда
		    Для сч =0 По Строки.Количество()-1 Цикл 
				Отбор.Вставить("ДиапазонСумм", Строки.Получить(сч).ДиапазонСумм); 
				СтрокиД = Объект.ДиапазоныСумм.НайтиСтроки(Отбор); 
				Если СтрокиД.Количество() > 1 Тогда 
					Сообщить("Дублирование диапазона сумм для статуса клиента " + СокрЛП(СтатусК) + "!");
					ВсеОК = Ложь;
					Прервать;
				КонецЕсли;	
			Конеццикла; 
		КонецЕсли;	
	Конеццикла;	    
	
	Возврат ВсеОК;
КонецФункции

&НаСервере
Процедура ПреобразоватьВ_ТЗ(Данные)
	Для Каждого Строка Из Данные.Строки Цикл 
		Если Строка.Пометка Тогда
			НовСтрока = Объект.СтатусыКлиентов.Добавить();
			НовСтрока.Статус = Строка.Статус; 
			
			Если Строка.ЭтоГруппа и Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
				
		Если Строка.Строки.Количество()>0 Тогда
		    ПреобразоватьВ_ТЗ(Строка);
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуСтатусов() 
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоСтатусов");
    Объект.СтатусыКлиентов.Очистить();
    ПреобразоватьВ_ТЗ(ДеревоЗначений); 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)  
	ЗаполнитьТаблицуСтатусов();	
	Если ПроверитьКорректностьЗаполнения() Тогда		
		СтруктураРезультат = Новый Структура;   
		СтруктураРезультат.Вставить("СхемаКредитования", Объект.СхемаКредитования);
		СтруктураРезультат.Вставить("СтатусыКлиентов", Объект.СтатусыКлиентов);
		СтруктураРезультат.Вставить("ДиапазоныСумм", Объект.ДиапазоныСумм);
		СтруктураРезультат.Вставить("ДниНачалаПрименения", Объект.ДниНачалаПрименения);
		Закрыть(СтруктураРезультат); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл		
		 Элементы.ДеревоСтатусов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(ЭлементыДерева)
	Для каждого Элемент Из ЭлементыДерева Цикл
		ВлЭлементыДерева = Элемент.ПолучитьЭлементы();
		Если ВлЭлементыДерева.Количество() > 0 Тогда
			СвернутьДерево(ВлЭлементыДерева);
		КонецЕсли;	
		Элементы.ДеревоСтатусов.Свернуть(Элемент.ПолучитьИдентификатор());
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	СвернутьДерево(ЭлементыДерева);
КонецПроцедуры  

&НаСервере
Процедура ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Группа, Пометка, Просмотр = неопределено)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл  
		Если Строка.ЭтоГруппа Тогда
			Если  НЕ (Строка.Статус = Группа) Тогда 
			    Продолжить; 
			КонецЕсли;	
		Иначе       
			Если НЕ ЗначениеЗаполнено(Строка.Родитель) Тогда
				Продолжить;
			ИначеЕсли Строка.Родитель.Статус = Группа Тогда 
			    Строка.Пометка = Пометка;  
				
				Если Просмотр = неопределено Тогда
				    Строка.ТолькоПросмотр = ?(Пометка, Истина, Ложь); 
				Иначе
					Строка.ТолькоПросмотр = Просмотр;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;		

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ПроставитьГалочкиПоГруппе(Строка, Группа, Пометка, Просмотр);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьОтметкуГруппы(Статус, Пометка)
	ДеревоНаСервере = РеквизитФормыВЗначение("ДеревоСтатусов");
	ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Статус, Пометка);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "ДеревоСтатусов");
КонецПроцедуры	

&НаСервере
Процедура ДоступностьСтатусов(ДеревоНаСервере, Пометка)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл  
		Если Строка.ЭтоГруппа Тогда
			Если ЗначениеЗаполнено(Строка.Статус) Тогда 
				Строка.ТолькоПросмотр = Пометка;
			 
				Строка.Пометка = Ложь;
		        Если НЕ Строка.Строки.Количество() = 0 Тогда
		            ПроставитьГалочкиПоГруппе(Строка, Строка.Статус, Ложь, Пометка); 
					
					Отбор = Новый Структура;
					Отбор.Вставить("Статус", Строка.Статус);
					
					Строки = Объект.ДниНачалаПрименения.НайтиСтроки(Отбор);
					Для каждого стр Из строки Цикл 
						Объект.ДниНачалаПрименения.Удалить(Стр);
					КонецЦикла;	  
					
					Строки = Объект.ДиапазоныСумм.НайтиСтроки(Отбор);
					Для каждого стр Из строки Цикл 
						Объект.ДиапазоныСумм.Удалить(Стр);
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
 	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьДоступностьСтатусов(Пометка)
	ДеревоНаСервере = РеквизитФормыВЗначение("ДеревоСтатусов");
	ДоступностьСтатусов(ДеревоНаСервере, Пометка);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "ДеревоСтатусов");
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтатусовПометкаПриИзменении(Элемент)
	ТекСтрока = Элементы.ДеревоСтатусов.ТекущиеДанные;   
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();	
	Если ТекСтрока.ЭтоГруппа Тогда
		ОбработатьОтметкуГруппы(ТекСтрока.Статус, ТекСтрока.Пометка);
		ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
		Для каждого ЭлементГруппа Из ЭлементыДерева Цикл
			Если ЭлементГруппа.Статус = ТекСтрока.Статус Тогда
				Если ТекСтрока.Пометка Тогда				
			        Элементы.ДеревоСтатусов.Развернуть(ЭлементГруппа.ПолучитьИдентификатор(), Истина);
				Иначе
					Элементы.ДеревоСтатусов.Свернуть(ЭлементГруппа.ПолучитьИдентификатор());
				КонецЕсли; 
				Элементы.ДеревоСтатусов.ТекущаяСтрока = ЭлементГруппа.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	    		 
	Иначе
		//проверить отметку родителя
		ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
		Для каждого Элемент Из ЭлементыДерева Цикл
			Если Элемент.ЭтоГруппа Тогда
				Пометка = Истина;
				ВлЭлементы = Элемент.ПолучитьЭлементы();
				Для каждого ВлЭлемент Из ВлЭлементы Цикл
					Если НЕ ВлЭлемент.Пометка Тогда
						Пометка = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Элемент.Пометка = Пометка;
				Прервать;
			КонецЕсли;	
		КонецЦикла;			
	КонецЕсли;  
	Если ТекСтрока.Пометка Тогда 
		Для каждого СтрП Из ПричиныПрименения Цикл
			НоваяСтр = Объект.ДниНачалаПрименения.Добавить(); 
		    НоваяСтр.ДеньНачалаПрименения = 1;  
			НоваяСтр.ПричинаПрименения = СтрП.ПричинаПрименения;
			НоваяСтр.Статус = ТекСтрока.Статус; 
		КонецЦикла;	
		Элементы.ДниНачалаПрименения.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Текстрока.Статус);
		Элементы.ДиапазоныСумм.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Текстрока.Статус);
	Иначе
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Текстрока.Статус);
		
		Строки = Объект.ДниНачалаПрименения.НайтиСтроки(Отбор);
		Для каждого стр Из строки Цикл 
			Объект.ДниНачалаПрименения.Удалить(Стр);
		КонецЦикла;	  
		
		Строки = Объект.ДиапазоныСумм.НайтиСтроки(Отбор);
		Для каждого стр Из строки Цикл 
			Объект.ДиапазоныСумм.Удалить(Стр);
		КонецЦикла;	
	КонецЕсли;	       
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Статус) Тогда //обработать изменение пометки все статусы
		УстановитьДоступностьСтатусов(ТекСтрока.Пометка);
	КонецЕсли;	
	УстановитьТекущуюСтрокуСтатусов();
КонецПроцедуры
	

&НаКлиенте
Процедура ДеревоСтатусовПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.ДеревоСтатусов.ТекущиеДанные; 
	Если ТекСтрока.ЭтоГруппа Тогда  
		Элементы.ДниНачалаПрименения.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Текстрока.Статус);
		Элементы.ДиапазоныСумм.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Текстрока.Статус); 
		Текущийстатус = Текстрока.Статус;
	Иначе                        
		Родитель = ДеревоСтатусов.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()).ПолучитьРодителя();
		Если НЕ Родитель = неопределено Тогда
			Если Родитель.Пометка Тогда    
				Элементы.ДниНачалаПрименения.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Родитель.Статус);
			    Элементы.ДиапазоныСумм.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Родитель.Статус);  
				Текущийстатус = Родитель.Статус;
			Иначе
				Элементы.ДниНачалаПрименения.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Текстрока.Статус);
			    Элементы.ДиапазоныСумм.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Текстрока.Статус);
				Текущийстатус = Текстрока.Статус;
			КонецЕсли;
		Иначе
			Элементы.ДниНачалаПрименения.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Текстрока.Статус);
			Элементы.ДиапазоныСумм.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", Текстрока.Статус); 
			Текущийстатус = Текстрока.Статус;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДниНачалаПримененияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) 
	ТекСтрока = Элементы.ДниНачалаПрименения.ТекущиеДанные;
	Если НоваяСтрока И НЕ Копирование  Тогда
		ТекСтрока.Статус = Текущийстатус;
		ТекСтрока.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма"); 
	ИначеЕсли НоваяСтрока И Копирование  Тогда
	    ТекСтрока.ДеньНачалаПрименения = 0;
	КонецЕсли;	 
	Если Копирование Тогда 
		ЭтаФорма.ТекущийЭлемент = Элементы.ДниНачалаПримененияДеньНачалаПрименения;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтатусовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДниНачалаПримененияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.ДниНачалаПрименения.Сортировать("ПричинаПрименения, ДеньНачалаПрименения");
КонецПроцедуры

&НаКлиенте
Процедура ДниНачалаПримененияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ) 
	ТекСтрока = Элементы.ДниНачалаПрименения.ТекущиеДанные;   
	Если Объект.Акция Тогда  
		Отбор = новый Структура;
		Отбор.Вставить("Статус", ТекСтрока.Статус);
		Отбор.Вставить("ПричинаПрименения", ТекСтрока.ПричинаПрименения);
			
		Строки = Объект.ДниНачалаПрименения.НайтиСтроки(Отбор);
		Если Строки.Количество() > 1 Тогда  
			Предупреждение("Строка с такими значениями уже есть в таблице", 60);
			Отказ = Истина;
		КонецЕсли;	 
	Иначе	
		//Если НЕ НоваяСтрока И ТекСтрока.ДеньНачалаПрименения = 0 Тогда
		//	Предупреждение("Необходимо заполнить день начала применения % схемы ", 60);
		//	Отказ = Истина;
		//Иначе	
			Отбор = новый Структура;
			Отбор.Вставить("Статус", ТекСтрока.Статус);
			Отбор.Вставить("ПричинаПрименения", ТекСтрока.ПричинаПрименения);
			Отбор.Вставить("ДеньНачалаПрименения", ТекСтрока.ДеньНачалаПрименения);
			
			Строки = Объект.ДниНачалаПрименения.НайтиСтроки(Отбор);
			Если Строки.Количество() > 1 Тогда  
				Предупреждение("Строка с такими значениями уже есть в таблице", 60);
				Отказ = Истина;
			КонецЕсли;	 
		//КонецЕсли;	
	КонецЕсли;	 	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьГалочкиВГруппе() 
    ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл	
		Если Элемент.Пометка Тогда
			Продолжить;
		КонецЕсли;	
		ВлЭлементы = Элемент.ПолучитьЭлементы();
		Если ВлЭлементы.Количество()  > 0 Тогда 
			ЕстьОтмеченные = ложь;
			Для каждого ВлЭлемент Из ВлЭлементы Цикл
				Если ВлЭлемент.Пометка Тогда
					ЕстьОтмеченные = Истина; 
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьОтмеченные Тогда
			    Элементы.ДеревоСтатусов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);   
			Иначе
				Элементы.ДеревоСтатусов.Свернуть(Элемент.ПолучитьИдентификатор());
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла;	

КонецПроцедуры	

&НаКлиенте
Процедура ДоступностьПоПустомуСтатусу()
	ЕстьОтметкаВсестатусы = Ложь;
    ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл	
		Если ЗначениеЗаполнено(Элемент.Статус) Тогда
			Продолжить;
		КонецЕсли;	
		Если Элемент.Пометка Тогда  
			ЕстьОтметкаВсестатусы = Истина; 
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	
	Если ЕстьОтметкаВсестатусы Тогда 
		УстановитьДоступностьСтатусов(Истина);
    КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьТекущуюСтрокуСтатусов() 
	ТекСтрока = Неопределено;
	ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл
		Если Элемент.Пометка Тогда
			ТекСтрока = Элемент;
			Прервать;
		КонецЕсли;	  
		Для Каждого ПодчиненныйЭлемент Из Элемент.ПолучитьЭлементы() Цикл 
			Если ПодчиненныйЭлемент.Пометка Тогда
				ТекСтрока = ПодчиненныйЭлемент;
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	   
		Если НЕ ТекСтрока = Неопределено Тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;

	Если ТекСтрока <> Неопределено Тогда
	    Элементы.ДеревоСтатусов.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	КонецЕсли;;
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ДоступностьПоПустомуСтатусу();
	УстановитьТекущуюСтрокуСтатусов(); 
	ПроставитьГалочкиВГруппе(); 
	Если Объект.Акция Тогда  
		Элементы.ДниНачалаПримененияДеньНачалаПрименения.Видимость =ложь; 
		Элементы.ДниНачалаПрименения.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДиапазоныСуммПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.ДиапазоныСумм.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекСтрока.Статус = Текущийстатус;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ДниНачалаПримененияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекСтрока = Элементы.ДеревоСтатусов.ТекущиеДанные;
	Если НЕ ТекСтрока.Пометка Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДиапазоныСуммПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекСтрока = Элементы.ДеревоСтатусов.ТекущиеДанные;
	Если НЕ ТекСтрока.Пометка Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры
